In [1]:
import pandas as pd

In [7]:
df=pd.DataFrame({"one":[1,2,3,4,5],
                "two":list('abcde'),
                "three":list('AAABB')})

In [8]:
df

   one three two
0    1     A   a
1    2     A   b
2    3     A   c
3    4     B   d
4    5     B   e

In [9]:
df['four']=1

In [10]:
df

   one three two  four
0    1     A   a     1
1    2     A   b     1
2    3     A   c     1
3    4     B   d     1
4    5     B   e     1

In [13]:
df_g=df.groupby('three')

In [35]:
import numpy as np
df_g.aggregate([sum, np.mean]).reset_index()

  three one      four
        sum mean  sum mean
0     A   6  2.0    3    1
1     B   9  4.5    2    1

In [41]:
df[['one','three']].groupby('three').aggregate(np.mean).reset_index()

  three  one
0     A  2.0
1     B  4.5

In [42]:
df[['one','three']].groupby('three').aggregate([sum, min, max]).reset_index()

  three one
        sum min max
0     A   6   1   3
1     B   9   4   5

In [7]:
df1=pd.DataFrame({"one":[1,2,3,4,5],
                "two":list('abcde'),
                "three":list('AAABB')}, index=[1,2,3,4,5])

In [8]:
df1

   one three two
1    1     A   a
2    2     A   b
3    3     A   c
4    4     B   d
5    5     B   e

In [9]:
df2=pd.DataFrame({"onetwo":[1,2,4,5]}, index=[1,2,3,4,])

In [12]:
df3=pd.concat([df1, df2['onetwo']], axis=1)
df3

In [13]:
df3

   one three two  onetwo
1    1     A   a       1
2    2     A   b       2
3    3     A   c       4
4    4     B   d       5
5    5     B   e     NaN

In [14]:
df2=pd.DataFrame({"onetwo":[1,2,4,5]})

In [15]:
df3=pd.concat([df1, df2['onetwo']], axis=1)
df3

   one three  two  onetwo
0  NaN   NaN  NaN       1
1    1     A    a       2
2    2     A    b       4
3    3     A    c       5
4    4     B    d     NaN
5    5     B    e     NaN

In [21]:
df3=pd.concat([df1, df2['onetwo']], axis=1,  join_axes=[df1.index])
df3

   one three two  onetwo
1    1     A   a       2
2    2     A   b       4
3    3     A   c       5
4    4     B   d     NaN
5    5     B   e     NaN

In [22]:
df3=pd.concat([df1, df2['onetwo']], axis=1,  join_axes=[df2.onetwo])
df3

        one three two  onetwo
onetwo
1         1     A   a       2
2         2     A   b       4
4         4     B   d     NaN
5         5     B   e     NaN